ELPasEDT/src/Documents/ОперативныйЖурнал/ОперативныйЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперативныйЖурнал</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <basedOn>Document.ОперативныйЖурнал</basedOn>
  <registerRecords>InformationRegister.СобытияОперативногоЖурнала</registerRecords>
  <registerRecords>InformationRegister.СостояниеОборудования</registerRecords>
  <registerRecords>InformationRegister.АктивныеСмены</registerRecords>
  <registerRecords>InformationRegister.ОборудованиеНаКонтроле</registerRecords>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>CatalogRef.ВидыЗаписей</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияИРаспоряжения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>CatalogRef.ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументаОперативногоЖурнала</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗакрытия</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вахта</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтаршийСмены</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаОборудования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоОт</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаПрописью</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаОборудованияДиспетчерское</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтданногоРаспоряжения</name>
    <type>
      <types>EnumRef.СтатусыОтданныхРаспоряжений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПерваяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Чистовик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>мШаблон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОборудования</name>
      <type>
        <types>EnumRef.СтатусыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАктуален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыходаИзСтроя</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонтныхРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольВыполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеЗаписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиспетчерскоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОборудования</name>
      <type>
        <types>EnumRef.СостоянияОборудованияОЖ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроляЗнаний</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыИРежимы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыИРежимы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставСмены</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.УдалитьПоказателиЧекЛиста</types>
        <types>CatalogRef.ПоказателиЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыДляОзнакомления</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.Журналы</types>
      </type>
    </attributes>
    <attributes>
      <name>КОзнакомлениюПринимающему</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/InformationRegisters/Распоряжения/Распоряжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Распоряжения</name>
  <resources>
    <name>ТекстРаспоряжения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРаспоряжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ознакомился</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/АктивныеСмены/АктивныеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктивныеСмены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СменаОткрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтаршийСмены</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Enums/СтатусыДокументаОперативногоЖурнала/СтатусыДокументаОперативногоЖурнала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументаОперативногоЖурнала</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Чистовик</name>
  </enumValues>
  <enumValues>
    <name>ЧистовикОтменен</name>
  </enumValues>
  <enumValues>
    <name>РаспоряжениеПолучено</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/Enums/СтатусыОтданныхРаспоряжений/СтатусыОтданныхРаспоряжений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтданныхРаспоряжений</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>НеВыполнено</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/Enums/СтатусыОборудования/СтатусыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОборудования</name>
  <enumValues>
    <name>ОборудованиеВРемонте</name>
  </enumValues>
  <enumValues>
    <name>ОборудованиеТребующееПовышенногоВнимания</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеПереключения</name>
  </enumValues>
  <enumValues>
    <name>ЗаписьОЖ</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/Catalogs/ВидыЗаписей/ВидыЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаписей</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <predefined>
    <items>
      <name>Авария</name>
      <description>Авария</description>
    </items>
    <items>
      <name>Включение</name>
      <description>Включение</description>
    </items>
    <items>
      <name>ДополнениеВСоставСмены</name>
      <description>Дополнение в состав смены</description>
    </items>
    <items>
      <name>ИзменениеРежимаРаботыОборудования</name>
      <description>Изменение режима работы оборудования</description>
    </items>
    <items>
      <name>КонтрольВнешний</name>
      <description>Контроль внешний</description>
    </items>
    <items>
      <name>КонтрольЖурнала</name>
      <description>Контроль журнала</description>
    </items>
    <items>
      <name>КонтрольОборудования</name>
      <description>Контроль оборудования</description>
    </items>
    <items>
      <name>Неисправность</name>
      <description>Неисправность</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
    <items>
      <name>ОперативныеПереговоры</name>
      <description>Оперативные переговоры</description>
    </items>
    <items>
      <name>ОтклонениеПараметров</name>
      <description>Отклонение параметров</description>
    </items>
    <items>
      <name>Отключение</name>
      <description>Отключение</description>
    </items>
    <items>
      <name>ПередачаСмены</name>
      <description>Передача смены</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>РаспоряжениеНСС</name>
      <description>Распоряжение НСС</description>
    </items>
    <items>
      <name>РемонтОборудования</name>
      <description>Ремонт оборудования</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗаполнятьТЧСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТЧОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСобытиеПоУмолчанию</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьЭЦП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьСобытия</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/Documents/ОперативныйЖурнал/Forms/Распоряжение/Module.bsl
&НаСервере
Функция СоздатьРаспоряжениеНаСервере(ТекущаяДатаКлиент, Сотрудник, Смена = Неопределено, Вахта = Неопределено, ДатаНачалаСмены = Неопределено, ДатаОкончанияСмены = Неопределено) 
	
	Если ТипЗнч(Сотрудник) = Тип("Строка") Тогда
		
		//Распоряжение для автора Распоряжения
		НовДок = Документы.ОперативныйЖурнал.СоздатьДокумент();
		НовДок.Дата = ТекущаяДатаКлиент;
		НовДок.ВидЗаписи = Справочники.ВидыЗаписей.РаспоряжениеНСС;
		НовДок.Событие = Справочники.События.ОтданоРаспоряжение;
		НовДок.Ответственный = Автор;
		НовДок.Комментарий = "НСС -> НСЦ " + Комментарий + " для " + Сотрудник;
		НовДок.Подразделение = Автор.Подразделение;
		НовДок.ДатаСобытия = ДатаСобытия;
		НовДок.Смена = Смена;
		НовДок.Вахта = Вахта;
		НовДок.Статус = Перечисления.СтатусыДокументаОперативногоЖурнала.Чистовик;
		НовДок.Чистовик = Истина;
		НовДок.ДатаНачалаСмены = ДатаНачалаСмены;
		НовДок.ДатаОкончанияСмены = ДатаОкончанияСмены;  
		НовДок.СтатусОтданногоРаспоряжения = Перечисления.СтатусыОтданныхРаспоряжений.НеВыполнено;
		Для Каждого ТекСтр Из СписокОборудования Цикл
			НовСтр = НовДок.Оборудование.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
			НовСтр.СтатусОборудования = Перечисления.СтатусыОборудования.ЗаписьОЖ;
		КонецЦикла;
		НовДок.Описание = СформироватьОписание(Вахта, Смена, ДатаНачалаСмены, Автор.Подразделение);
		
		Попытка
			НовДок.Записать(РежимЗаписиДокумента.Проведение);		
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		ДокументРаспоряжение = НовДок.Ссылка;
		
	ИначеЕсли ТипЗнч(Сотрудник) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		//Распоряжение для Сотрудника
		НовДок = Документы.ОперативныйЖурнал.СоздатьДокумент();
		НовДок.Дата = ТекущаяДатаКлиент;
		НовДок.ВидЗаписи = Справочники.ВидыЗаписей.РаспоряжениеНСС;
		НовДок.Событие = Справочники.События.ПолученоРаспоряжение;
		НовДок.Ответственный = ПолучитьПользователя(Сотрудник);
		НовДок.Комментарий = "НСС -> НСЦ " + Комментарий;//"Распоряжение от " + Автор + ": " + Комментарий;
		НовДок.Подразделение = Сотрудник.Подразделение;
		НовДок.ДатаСобытия = ДатаСобытия;
		НовДок.Смена = Смена;
		НовДок.Вахта = Вахта;
		НовДок.Статус = Перечисления.СтатусыДокументаОперативногоЖурнала.РаспоряжениеПолучено;
		НовДок.ДатаНачалаСмены = ДатаНачалаСмены;
		НовДок.ДатаОкончанияСмены = ДатаОкончанияСмены;
		НовДок.ПолученоОт = Автор;
		НовДок.Распоряжение = ДокументРаспоряжение;
		Для Каждого ТекСтр Из СписокОборудования Цикл
			НовСтр = НовДок.Оборудование.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
			НовСтр.СтатусОборудования = Перечисления.СтатусыОборудования.ЗаписьОЖ;
		КонецЦикла;
		НовДок.Описание = СформироватьОписание(Вахта, Смена, ДатаНачалаСмены, Автор.Подразделение);
		
		Попытка
			НовДок.Записать();
			Сообщить("Сформировано распоряжение " + НовДок + " для сотрудника " + Сотрудник);
			//20180312
			//ДобавитьДвиженияПоРаспоряжению(НовДок.Ссылка);
			ДобавитьДвиженияПоРаспоряжению(НовДок.Ссылка, ДокументРаспоряжение);
			//20180312
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 	
		
	КонецЕсли; 
	
КонецФункции

Функция СформироватьОписание(Вахта, Смена, ДатаНачалаСмены, Подразделение) 	
		
	Если стрДлина(Строка(Смена.ВремяНачала)) = 19 Тогда
		тВремяНачала = " " + Лев(Прав(Смена.ВремяНачала, 8), 5);
	Иначе
		тВремяНачала = Лев(Прав(Смена.ВремяНачала, 8), 5);
	КонецЕсли;	
	тВремяОкончания = Лев(Прав(Смена.ВремяОкончания, 8), 5); 		
	СменаПрописью = Формат(ДатаНачалаСмены, "ДФ=dd/MM/yy") + тВремяНачала + " - " + тВремяОкончания; 		
	Описание = "" + Формат(ТекущаяДата(), "ДЛФ=DDT") + " " + Подразделение + "        " + Вахта + "        " + Смена + "        " + СменаПрописью;
	Возврат Описание;  		
	
КонецФункции

&НаСервере
Процедура ДобавитьДвиженияПоРаспоряжению(НовДок, ДокументРаспоряжение)
	
	МенеджерЗаписи = РегистрыСведений.Распоряжения.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Распоряжение = ДокументРаспоряжение;
	МенеджерЗаписи.Ответственный = НовДок.Ответственный;
	МенеджерЗаписи.ТекстРаспоряжения = НовДок.Комментарий;
	МенеджерЗаписи.ДатаРаспоряжения = ТекущаяДатаСеанса(); 
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователя(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо
		|	И НЕ Пользователи.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьСписокСотрудников() 
	
	СменаНСС = ПолучитьСменуНСС();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктивныеСмены.СтаршийСмены.ФизическоеЛицо КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Пользователи
	|ИЗ
	|	РегистрСведений.АктивныеСмены КАК АктивныеСмены
	|ГДЕ
	|	АктивныеСмены.Подразделение В ИЕРАРХИИ(&Подразделение)
	|	И АктивныеСмены.СменаОткрыта
	|	И АктивныеСмены.Смена = &Смена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Пользователи.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_СотрудникиПринявшиеСмену
	|ИЗ
	|	ВТ_Пользователи КАК ВТ_Пользователи
	|ГДЕ
	|	ВТ_Пользователи.Сотрудник.НСЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеСменыСрезПоследних.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ДокументПриемаСмены
	|ИЗ
	|	РегистрСведений.АктивныеСмены.СрезПоследних(
	|			,
	|			Подразделение = &Подразделение
	|				И СтаршийСмены = &СтаршийСмены) КАК АктивныеСменыСрезПоследних
	|ГДЕ
	|	АктивныеСменыСрезПоследних.СменаОткрыта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОперативныйЖурналСотрудники.Ссылка.Вахта КАК Вахта,
	|	ОперативныйЖурналСотрудники.Ссылка.Смена КАК Смена,
	|	ОперативныйЖурналСотрудники.Ссылка.СтаршийСмены.ФизическоеЛицо КАК СтаршийСменыФизическоеЛицо,
	|	Ложь КАК Выбран,
	|	ОперативныйЖурналСотрудники.Ссылка.ДатаНачалаСмены КАК ДатаНачалаСмены,
	|	ОперативныйЖурналСотрудники.Ссылка.ДатаОкончанияСмены КАК ДатаОкончанияСмены,
	|	ОперативныйЖурналСотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.ОперативныйЖурнал.Сотрудники КАК ОперативныйЖурналСотрудники
	|ГДЕ
	|	ОперативныйЖурналСотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ДокументПриемаСмены.Регистратор КАК Регистратор
	|			ИЗ
	|				ВТ_ДокументПриемаСмены КАК ВТ_ДокументПриемаСмены)
	|	И ОперативныйЖурналСотрудники.Выбран
	|	И ОперативныйЖурналСотрудники.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_СотрудникиПринявшиеСмену.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_СотрудникиПринявшиеСмену КАК ВТ_СотрудникиПринявшиеСмену)";
	
	Запрос.УстановитьПараметр("Подразделение", Автор.Подразделение);
	Запрос.УстановитьПараметр("Смена", СменаНСС);
	Запрос.УстановитьПараметр("СтаршийСмены", Автор);
	
	//масСотрудники = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	АктивныеСмены.Период КАК Период,
	//	|	АктивныеСмены.Регистратор КАК Регистратор
	//	|ПОМЕСТИТЬ ВТ_Регистр
	//	|ИЗ
	//	|	РегистрСведений.АктивныеСмены КАК АктивныеСмены
	//	|ГДЕ
	//	|	АктивныеСмены.Подразделение В ИЕРАРХИИ(&Подразделение)
	//	|	И АктивныеСмены.СменаОткрыта
	//	|	И АктивныеСмены.Смена = &Смена
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	МАКСИМУМ(ВТ_Регистр.Период) КАК Период
	//	|ПОМЕСТИТЬ ВТ_ПоследняяЗаписьПоПодразделению
	//	|ИЗ
	//	|	ВТ_Регистр КАК ВТ_Регистр
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Регистр.Регистратор КАК Регистратор
	//	|ПОМЕСТИТЬ ВТ_Регистратор
	//	|ИЗ
	//	|	ВТ_Регистр КАК ВТ_Регистр
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследняяЗаписьПоПодразделению КАК ВТ_ПоследняяЗаписьПоПодразделению
	//	|		ПО ВТ_Регистр.Период = ВТ_ПоследняяЗаписьПоПодразделению.Период
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ОперативныйЖурналСотрудники.Сотрудник КАК Сотрудник
	//	|ИЗ
	//	|	Документ.ОперативныйЖурнал.Сотрудники КАК ОперативныйЖурналСотрудники
	//	|ГДЕ
	//	|	ОперативныйЖурналСотрудники.Ссылка В
	//	|			(ВЫБРАТЬ
	//	|				ВТ_Регистратор.Регистратор КАК Регистратор
	//	|			ИЗ
	//	|				ВТ_Регистратор КАК ВТ_Регистратор)
	//	|	И ОперативныйЖурналСотрудники.Выбран
	//	|	И ОперативныйЖурналСотрудники.Сотрудник.Должность = &ДолжностьНСЦ";
	//
	//Запрос.УстановитьПараметр("Подразделение", Автор.Подразделение);
	//Запрос.УстановитьПараметр("Смена", СменаНСС);
	//Запрос.УстановитьПараметр("ДолжностьНСЦ", ПолучитьДолжностьНСЦ());
	//
	//масСотрудники = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	//
	//////////////////////////////////
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	АктивныеСмены.Период КАК Период,
	//	|	АктивныеСмены.Регистратор КАК Регистратор
	//	|ПОМЕСТИТЬ ВТ_Регистр
	//	|ИЗ
	//	|	РегистрСведений.АктивныеСмены КАК АктивныеСмены
	//	|ГДЕ
	//	|	АктивныеСмены.СтаршийСмены.ФизическоеЛицо В(&масСотрудники)
	//	|	И АктивныеСмены.СменаОткрыта
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	МАКСИМУМ(ВТ_Регистр.Период) КАК Период
	//	|ПОМЕСТИТЬ ВТ_ПоследняяЗаписьПоПодразделению
	//	|ИЗ
	//	|	ВТ_Регистр КАК ВТ_Регистр
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Регистр.Регистратор КАК Регистратор
	//	|ПОМЕСТИТЬ ВТ_ДокументСменыСдачи
	//	|ИЗ
	//	|	ВТ_Регистр КАК ВТ_Регистр
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследняяЗаписьПоПодразделению КАК ВТ_ПоследняяЗаписьПоПодразделению
	//	|		ПО ВТ_Регистр.Период = ВТ_ПоследняяЗаписьПоПодразделению.Период
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ОперативныйЖурналСотрудники.Ссылка.Вахта КАК Вахта,
	//	|	ОперативныйЖурналСотрудники.Ссылка.Смена КАК Смена,
	//	|	ОперативныйЖурналСотрудники.Ссылка.СтаршийСмены.ФизическоеЛицо КАК Сотрудник,
	//	|	ИСТИНА КАК Выбран,
	//	|	ОперативныйЖурналСотрудники.Ссылка.ДатаНачалаСмены КАК ДатаНачалаСмены,
	//	|	ОперативныйЖурналСотрудники.Ссылка.ДатаОкончанияСмены КАК ДатаОкончанияСмены
	//	|ИЗ
	//	|	Документ.ОперативныйЖурнал.Сотрудники КАК ОперативныйЖурналСотрудники
	//	|ГДЕ
	//	|	ОперативныйЖурналСотрудники.Ссылка В
	//	|			(ВЫБРАТЬ
	//	|				ВТ_ДокументСменыСдачи.Регистратор КАК Регистратор
	//	|			ИЗ
	//	|				ВТ_ДокументСменыСдачи КАК ВТ_ДокументСменыСдачи)
	//	|	И ОперативныйЖурналСотрудники.Выбран";
	//
	//Запрос.УстановитьПараметр("масСотрудники", масСотрудники);
	
	СписокСотрудников.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервере
Функция ПолучитьСменуНСС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивныеСменыСрезПоследних.Смена КАК Смена
		|ИЗ
		|	РегистрСведений.АктивныеСмены.СрезПоследних(
		|			,
		|			Подразделение = &Подразделение
		|				И СтаршийСмены = &СтаршийСмены) КАК АктивныеСменыСрезПоследних
		|ГДЕ
		|	АктивныеСменыСрезПоследних.СменаОткрыта";
	
	Запрос.УстановитьПараметр("Подразделение", Автор.Подразделение);
	Запрос.УстановитьПараметр("СтаршийСмены", Автор);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Смена;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//&НаСервере
//Функция ПолучитьДолжностьНСЦ()
//	
//	Запрос = Новый Запрос;
//	
//	Запрос.Текст =  	
//	"ВЫБРАТЬ
//	|	Должности.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.Должности КАК Должности
//	|ГДЕ
//	|	НЕ Должности.ПометкаУдаления
//	|	И Должности.Наименование = &Наименование";
//	
//	Запрос.УстановитьПараметр("Наименование", "Начальник смены цеха");
//	
//	Результат = Запрос.Выполнить().Выбрать();
//	
//	Если Результат.Следующий() Тогда
//		Возврат Результат.Ссылка;
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции

&НаКлиенте
Процедура СоздатьРаспоряжение(Команда)
	
	//20180926
	//Проверка заполнения Оборудования
	ПроверкаПоОборудованию = Истина;
	НомСтр = 1;
	Для Каждого ТекСтр Из СписокОборудования Цикл
		Если Не ЗначениеЗаполнено(ТекСтр.Оборудование) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнено Оборудование в строке " + НомСтр;
			Сообщение.Поле = "Объект.СписокОборудования["+(НомСтр-1)+"].Оборудование";
			Сообщение.Сообщить();			
			ПроверкаПоОборудованию = Ложь;
		КонецЕсли;
		НомСтр = НомСтр + 1;
	КонецЦикла;
	Если Не ПроверкаПоОборудованию Тогда
		Возврат;
	КонецЕсли;
	//20180926
	
	Если Не ЗначениеЗаполнено(Комментарий) Тогда
		ПоказатьПредупреждение(,"Заполните текст распоряжения!");
		Возврат;
	КонецЕсли;
	
	РаспоряженияСформированы = Ложь;
	// 	
	СтруктураПараметров = Новый Структура("Вахта, Смена, ДатаНачалаСмены, ДатаОкончанияСмены");
	ЗаполнитьСтруктуруПараметров(СтруктураПараметров);
	Для Каждого ТекСтр Из СписокСотрудников Цикл
		Если ТекСтр.Выбран Тогда
			ТекущаяДатаКлиент = ТекущаяДата();
			//Распоряжение автору
			СоздатьРаспоряжениеНаСервере(ТекущаяДатаКлиент, Строка(ТекСтр.Сотрудник), СтруктураПараметров.Смена, СтруктураПараметров.Вахта, СтруктураПараметров.ДатаНачалаСмены, СтруктураПараметров.ДатаОкончанияСмены);
			//Распоряжения сотрудникам
			СоздатьРаспоряжениеНаСервере(ТекущаяДатаКлиент, ТекСтр.Сотрудник, ТекСтр.Смена, ТекСтр.Вахта, ТекСтр.ДатаНачалаСмены, ТекСтр.ДатаОкончанияСмены);
			РаспоряженияСформированы = Истина;
		КонецЕсли;
	КонецЦикла;
	//
	Если РаспоряженияСформированы Тогда
		ПоказатьПредупреждение(,"Распоряжения сформированы!");
		//Оповестить("ОбновитьСписокОЖ");
	Иначе 
		ПоказатьПредупреждение(,"Сотрудники для распоряжения не выбраны!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруПараметров(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивныеСмены.Период КАК Период,
		|	АктивныеСмены.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_Регистр
		|ИЗ
		|	РегистрСведений.АктивныеСмены КАК АктивныеСмены
		|ГДЕ
		|	АктивныеСмены.Подразделение = &Подразделение
		|	И АктивныеСмены.СтаршийСмены = &СтаршийСмены
		|	И АктивныеСмены.СменаОткрыта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_Регистр.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПоследняяЗаписьПоПодразделению
		|ИЗ
		|	ВТ_Регистр КАК ВТ_Регистр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Регистр.Регистратор.Вахта КАК Вахта,
		|	ВТ_Регистр.Регистратор.Смена КАК Смена,
		|	ВТ_Регистр.Регистратор.ДатаНачалаСмены КАК ДатаНачалаСмены,
		|	ВТ_Регистр.Регистратор.ДатаОкончанияСмены КАК ДатаОкончанияСмены
		|ИЗ
		|	ВТ_Регистр КАК ВТ_Регистр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследняяЗаписьПоПодразделению КАК ВТ_ПоследняяЗаписьПоПодразделению
		|		ПО ВТ_Регистр.Период = ВТ_ПоследняяЗаписьПоПодразделению.Период";
	
	Запрос.УстановитьПараметр("Подразделение", Автор.Подразделение);
	Запрос.УстановитьПараметр("СтаршийСмены", Автор);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Результат);
	КонецЕсли;   	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	ДатаПриемаСмены = ОперативныйЖурнал.ПолучитьДатуПриемаСмены(Автор);
	ЗаполнитьСписокСотрудников();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОборудованияПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокОборудования.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокОборудования.НайтиСтроки(Новый Структура("Оборудование", ТекДанные.Оборудование)).Количество() > 1 Тогда
		ПоказатьПредупреждение(,"Данное оборудование уже есть в табличной части!");
		СписокОборудования.Удалить(ТекДанные);
		Возврат;
	КонецЕсли;
	
	ТекДанные.ДиспетчерскоеНаименование = ПолучитьДиспетчерскоеНаименование(ТекДанные.Оборудование);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДиспетчерскоеНаименование(Оборудование)
	
	Возврат Оборудование.ДиспетчерскоеНаименование;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьВсехСотрудников(Команда)
	
	Для Каждого СтрСотрудник Из СписокСотрудников Цикл
		СтрСотрудник.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсехСотрудников(Команда)
	
	Для Каждого СтрСотрудник Из СписокСотрудников Цикл
		СтрСотрудник.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаСобытия = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСобытияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДатаПриемаСмены) Тогда
		Если ДатаСобытия < ДатаПриемаСмены Тогда
			ПоказатьПредупреждение(, "Нельзя создать документ ранее начала приема смены (" + Формат(ДатаПриемаСмены, "ДЛФ=DDT") + ").");
			ДатаСобытия = ДатаПриемаСмены + 1;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
